export type MysqlDataTypes =
// Цілі числа
	'TINYINT' | // Дуже маленьке ціле число
	'SMALLINT' | // Маленьке ціле число
	'MEDIUMINT' | // Середнє ціле число
	'INT' | // Звичайне ціле число
	'BIGINT' | // Велике ціле число

	// Числа з плаваючою комою
	'DECIMAL' | // Число з фіксованою точністю, може мати два параметри: точність та масштаб
	'FLOAT' | // Число з плаваючою комою, може мати два параметри: точність та масштаб
	'DOUBLE' | // Подвійна точність числа з плаваючою комою
	'NUMERIC' |
	'REAL' |

	//БІТОВІ
	'BIT' | // Рядок бітів фіксованої довжини, вказується кількість бітів


	// Логічний тип
	'BOOLEAN' | // Логічне значення

	// Дати та час
	'DATE' | // Дата
	'DATETIME' | // Дата та час
	'TIMESTAMP' | // Дата та час (завжди оновлюється при оновленні рядка)
	'TIME' | // Час
	'YEAR' | // Рік

	//TEXT
	//має параметри
	'CHAR' | // Рядок фіксованої довжини, вказується довжина рядка
	'VARCHAR' | // Рядок змінної довжини, вказується максимальна довжина рядка
	//не має параметрів
	'TINYTEXT' | // Текст невеликої довжини
	'TEXT' | // Текст
	'MEDIUMTEXT' | // Текст середньої довжини
	'LONGTEXT' | // Текст великої довжини

	// Бінарні дані
	'BINARY' | // Рядок бітів фіксованої довжини, вказується довжина рядка
	'VARBINARY' | // Рядок бітів змінної довжини, вказується максимальна довжина рядка
	'TINYBLOB' | // Бінарні дані невеликого розміру
	'BLOB' | // Бінарні дані
	'MEDIUMBLOB' | // Бінарні дані середнього розміру
	'LONGBLOB' | // Бінарні дані великого розміру

	// Перерахування та множини
	'ENUM' | // Перерахування значень, перелік значень
	'SET' | // Множина значень, перелік значень

	// JSON та геометрія
	'JSON' | // JSON-дані
	'GEOMETRY' | // Геометричні дані

	// Географічні типи
	'POINT' | // Точка
	'LINESTRING' | // Лінія
	'POLYGON' | // Полігон
	'MULTIPOINT' | // Мульти-точка
	'MULTILINESTRING' | // Мульти-лінія
	'MULTIPOLYGON' | // Мульти-полігон
	'GEOMETRYCOLLECTION' | // Колекція геометричних об'єктів

	// Інші
	'INTERVAL' | // Інтервал тип інтервалу
	'NULL' // Спеціальне значення NULL
