// Типи даних в postgres
export type PostgresqlDataTypes =
	'SMALLINT' | // маленьке ціло числене число
	'INTEGER' | // середнє ціло числене число
	'BIGINT' | // велике ціло числене число

	'NUMERIC' | // число з плавайочую комою, точне в обчисленнях, використовується зазвичай для грошей
	'REAL' | // число з плавайочую комою, менш точне нід numeric, але поміщає в себе більшу кількість цифр після коми
	'FLOAT' | // число з плавайочую комою, менш точне нід numeric, але поміщає в себе більшу ще більшу кількість цифр після коми ніж REAL

	'SMALLSERIAL' | // автоінкремент, 2 байти(маленька кількість чисел)
	'SERIAL' | // автоінкремент, 4 байти(середня кількість чисел)
	'BIGSERIAL' | // автоінкремент, 8 байти(велика кількість чисел)

	'CHAR' | // рядок вказаної довжини, якщо ми передаємо туди рядок довжиною 8, а тип був з параметром 10, то пусте місце заповниться пробілами
	'VARCHAR' | // рядок вказаної довжини, але якщо ми передамо туди менший рядок, то вільне місце не буде заповнятися пробілами
	'TEXT' | // не буде виникати помилки якшо задати текст довільної довжини

	'BOOLEAN' |

	'DATE' | // дата
	'TIME' | // час
	'TIMESTAMP' | // дата та час
	'INTERVAL' | // інтервал, зазвичай використовується для різниці timestamp'ів
	'TIMESTAMPTZ' // timestamp з тайм зоною

//arrays
//jsons
//xml
//custom types
//geometry types
//null