// Типи даних в postgres

//arrays
export type PostgresqlDataTypes =
	'SMALLINT' | // маленьке ціло числене число
	'INTEGER' | // середнє ціло числене число
	'BIGINT' | // велике ціло числене число
	'INT2' |
	'INT4' |
	'INT8' |

	'NUMERIC' | // число з плавайочую комою, точне в обчисленнях, використовується зазвичай для грошей
	'REAL' | // число з плавайочую комою, менш точне нід numeric, але поміщає в себе більшу кількість цифр після коми
	'FLOAT' | // число з плавайочую комою, менш точне нід numeric, але поміщає в себе більшу ще більшу кількість цифр після коми ніж REAL
	'DOUBLE' |
	'PRECISION' |
	'DECIMAL' |
	'FLOAT4' |
	'FLOAT8' |

	//Інкрементальні типи
	'SMALLSERIAL' | // автоінкремент, 2 байти(маленька кількість чисел)
	'SERIAL' | // автоінкремент, 4 байти(середня кількість чисел)
	'BIGSERIAL' | // автоінкремент, 8 байти(велика кількість чисел)
	'SERIAL2' |
	'SERIAL4' |
	'SERIAL8' |

	//Логічний тип даних
	'BOOLEAN' |

	//TEXT
	//з параметрами
	'CHARACTER VARYING' | //Цей тип даних представляє собою рядок змінної довжини, який може містити будь-яку послідовність символів. Параметр n вказує максимальну довжину рядка у символах.
	'CHARACTER' | //Це аналогічно до CHARACTER VARYING, але використовує фіксовану довжину рядка. Параметр n вказує довжину рядка у символах.
	'BPCHAR' | // Цей тип є альтернативним псевдонімом для типу CHARACTER. Він також використовує фіксовану довжину рядка. Параметр n вказує довжину рядка у символах.
	'CHAR' | // рядок вказаної довжини, якщо ми передаємо туди рядок довжиною 8, а тип був з параметром 10, то пусте місце заповниться пробілами
	'VARCHAR' | // рядок вказаної довжини, але якщо ми передамо туди менший рядок, то вільне місце не буде заповнятися пробілами
	//без параметрів
	'CITEXT' | //Цей тип даних є регулярним текстовим типом, що ігнорує регістр. Це означає, що він здатен розрізняти рядки за їхнім змістом, а не за регістром символів. Цей тип не має параметрів.
	'TEXT' | // не буде виникати помилки якшо задати текст довільної довжини

	'DATE' | // дата
	'TIME' | // час
	'TIMESTAMP' | // дата та час
	'INTERVAL' | // інтервал, зазвичай використовується для різниці timestamp'ів
	'TIMESTAMPTZ' // timestamp з тайм зоною
//jsons
//xml
//custom types
//geometry types
//null