// Типи даних в postgresql
export enum PostgresqlDataTypes {
	SMALLINT = 'SMALLINT', // маленьке ціло числене число
	INTEGER = 'INTEGER', // середнє ціло числене число
	BIGINT = 'BIGINT', // велике ціло числене число

	NUMERIC = 'NUMERIC', // число з плавайочую комою, точне в обчисленнях, використовується зазвичай для грошей
	REAL = 'REAL', // число з плавайочую комою, менш точне нід numeric, але поміщає в себе більшу кількість цифр після коми
	FLOAT = 'FLOAT', // число з плавайочую комою, менш точне нід numeric, але поміщає в себе більшу ще більшу кількість цифр після коми ніж REAL

	SMALLSERIAL = 'SMALLSERIAL', // автоінкремент, 2 байти(маленька кількість чисел)
	SERIAL = 'SERIAL', // автоінкремент, 4 байти(середня кількість чисел)
	BIGSERIAL = 'BIGSERIAL', // автоінкремент, 8 байти(велика кількість чисел)

	CHAR = 'CHAR', // рядок вказаної довжини, якщо ми передаємо туди рядок довжиною 8, а тип був з параметром 10, то пусте місце заповниться пробілами
	VARCHAR = 'VARCHAR', // рядок вказаної довжини, але якщо ми передамо туди менший рядок, то вільне місце не буде заповнятися пробілами
	TEXT = 'TEXT', // не буде виникати помилки якшо задати текст довільної довжини

	BOOLEAN = 'BOOLEAN',

	DATE = 'DATE', // дата
	TIME = 'TIME', // час
	TIMESTAMP = 'TIMESTAMP', // дата та час
	INTERVAL = 'INTERVAL', // інтервал, зазвичай використовується для різниці timestamp'ів
	TIMESTAMPTZ = 'TIMESTAMPTZ', // timestamp з тайм зоною

	//arrays
	//jsons
	//xml
	//custom types
	//geometry types
	//null
}